In [11]:
import pandas as pd
import json
import configparser
import psycopg2

In [12]:
config =configparser.ConfigParser()
config.read_file(open('dl.cfg'))

In [13]:
KEY = config.get("AWS","AWS_ACCESS_KEY_ID")

SECRET = config.get("AWS","AWS_SECRET_ACCESS_KEY")



DWH_CLUSTER_TYPE       = config.get("DWH","DWH_CLUSTER_TYPE")
DWH_NUM_NODES          = config.get("DWH","DWH_NUM_NODES")
DWH_NODE_TYPE          = config.get("DWH","DWH_NODE_TYPE")
DWH_CLUSTER_IDENTIFIER = config.get("DWH","DWH_CLUSTER_ID")



DWH_ENDPOINT           = config.get("CLUSTER","host")

DWH_DB                 = config.get("CLUSTER","DB_NAME")
DWH_DB_USER            = config.get("CLUSTER","DB_USER")
DWH_DB_PASSWORD        = config.get("CLUSTER","DB_PASSWORD")
DWH_PORT               = config.get("CLUSTER","DB_PORT")

DWH_IAM_ROLE_NAME      = config.get("DWH", "ROLE_NAME")

In [4]:
%reload_ext sql

In [5]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

postgresql://charles:Obamly01@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb

'Connected: charles@dwhdb'

In [18]:
%sql SELECT count(*) FROM staging_immigration;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(2994504,)]

In [19]:
%sql SELECT count(*) FROM staging_airport;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(1041,)]

In [16]:
%sql SELECT count(*) FROM staging_demography;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(49,)]

In [17]:
%sql SELECT count(*) FROM staging_landtemp;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(141930,)]

##### View of invalid records seen in the immigration dataset

In [33]:
%sql SELECT SUM(CASE WHEN CAST(arrivedate_id AS date) > departdate THEN 1 ELSE 0 END) AS invalid_records FROM factArrivetheUsa;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
1 rows affected.

[(268,)]

In [42]:
%sql SELECT arrivedate_id,departdate,(CASE WHEN CAST(arrivedate_id AS date) > departdate THEN 'invalid' ELSE 'valid' END) AS invalid_records FROM factArrivetheUsa \
WHERE CAST(arrivedate_id AS date) > departdate LIMIT 20;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
20 rows affected.

[('2016-04-18', datetime.date(2016, 4, 11), 'invalid'),
 ('2016-04-18', datetime.date(2016, 4, 16), 'invalid'),
 ('2016-04-16', datetime.date(2016, 4, 14), 'invalid'),
 ('2016-04-22', datetime.date(2016, 4, 11), 'invalid'),
 ('2016-04-08', datetime.date(2015, 10, 22), 'invalid'),
 ('2016-04-08', datetime.date(2016, 4, 6), 'invalid'),
 ('2016-04-17', datetime.date(2016, 4, 10), 'invalid'),
 ('2016-04-28', datetime.date(2016, 4, 25), 'invalid'),
 ('2016-04-24', datetime.date(2016, 4, 17), 'invalid'),
 ('2016-04-18', datetime.date(2016, 4, 16), 'invalid'),
 ('2016-04-21', datetime.date(2016, 4, 12), 'invalid'),
 ('2016-04-30', datetime.date(2016, 4, 9), 'invalid'),
 ('2016-04-30', datetime.date(2016, 4, 29), 'invalid'),
 ('2016-04-17', datetime.date(2016, 4, 10), 'invalid'),
 ('2016-04-10', datetime.date(2016, 4, 6), 'invalid'),
 ('2016-04-24', datetime.date(2016, 4, 8), 'invalid'),
 ('2016-04-08', datetime.date(2016, 4, 7), 'invalid'),
 ('2016-04-16', datetime.date(2016, 4, 9), 'invalid'),
 ('2016-04-08', datetime.date(2016, 3, 23), 'invalid'),
 ('2016-04-25', datetime.date(2016, 4, 24), 'invalid')]

Query Eample 1

In [38]:
%sql SELECT D.Tourist_id,F.arrivedate_id,F.departdate,F.arrivalFlag,F.departureFlag,F.updateFlag,F.matchFlag FROM ((factArrivetheUsa F JOIN dimTourist D \
            ON F.Tourist_id = D.Tourist_id) \
            JOIN dimArriveDate A ON A.arrivedate_id = F.arrivedate_id) \
            WHERE CAST(F.arrivedate_id AS date) < F.departdate AND A.year =2016 AND A.month = 4 LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[(407.0, '2016-04-01', datetime.date(2016, 4, 21), 'G', 'O', 'Nil', 'M'),
 (1330.0, '2016-04-01', datetime.date(2016, 4, 6), 'G', 'O', 'Nil', 'M'),
 (5281.0, '2016-04-01', datetime.date(2016, 4, 8), 'G', 'O', 'Nil', 'M'),
 (5974.0, '2016-04-01', datetime.date(2016, 4, 2), 'O', 'I', 'Nil', 'M'),
 (6037.0, '2016-04-01', datetime.date(2016, 4, 8), 'G', 'K', 'Nil', 'M'),
 (6492.0, '2016-04-01', datetime.date(2016, 4, 6), 'G', 'O', 'Nil', 'M'),
 (7032.0, '2016-04-01', datetime.date(2016, 4, 9), 'G', 'O', 'Nil', 'M'),
 (9674.0, '2016-04-01', datetime.date(2016, 4, 9), 'G', 'O', 'Nil', 'M'),
 (10949.0, '2016-04-01', datetime.date(2016, 4, 9), 'G', 'O', 'Nil', 'M'),
 (11211.0, '2016-04-01', datetime.date(2016, 4, 10), 'G', 'O', 'Nil', 'M')]

Query Example 2

In [39]:
%sql SELECT D.Tourist_id,F.arrivedate_id,F.departdate,F.arrivalFlag,F.departureFlag,F.updateFlag,F.matchFlag FROM ((factArrivetheUsa F JOIN dimTourist D \
            ON F.Tourist_id = D.Tourist_id) \
            JOIN dimArriveDate A ON A.arrivedate_id = F.arrivedate_id) \
            WHERE CAST(F.arrivedate_id AS date) < F.departdate AND F.updateFlag != 'Nil' AND A.year =2016 AND A.month = 4 LIMIT 10;

 * postgresql://charles:***@dwhredshift.cnzh9zuhoqzo.us-west-2.redshift.amazonaws.com:5439/dwhdb
10 rows affected.

[(2560347.0, '2016-04-14', datetime.date(2016, 6, 16), 'G', 'O', 'U', 'M'),
 (5008786.0, '2016-04-26', datetime.date(2016, 9, 2), 'G', 'N', 'U', 'M'),
 (617105.0, '2016-04-03', datetime.date(2016, 4, 30), 'G', 'O', 'U', 'M'),
 (977290.0, '2016-04-05', datetime.date(2016, 4, 16), 'G', 'O', 'U', 'M'),
 (3885664.0, '2016-04-21', datetime.date(2016, 8, 16), 'G', 'O', 'U', 'M'),
 (4915950.0, '2016-04-26', datetime.date(2016, 5, 1), 'G', 'O', 'U', 'M'),
 (3283684.0, '2016-04-17', datetime.date(2016, 8, 12), 'G', 'I', 'U', 'M'),
 (5733290.0, '2016-04-30', datetime.date(2016, 5, 7), 'G', 'O', 'U', 'M'),
 (889163.0, '2016-04-05', datetime.date(2016, 6, 2), 'G', 'O', 'U', 'M'),
 (2144258.0, '2016-04-11', datetime.date(2016, 5, 5), 'G', 'N', 'U', 'M')]